AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
/*
    This file is part of MutekH.

    MutekH is free software; you can redistribute it and/or modify it
    under the terms of the GNU Lesser General Public License as
    published by the Free Software Foundation; version 2.1 of the
    License.

    MutekH is distributed in the hope that it will be useful, but
    WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with MutekH; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
    02110-1301 USA.

    Copyright Alexandre Becoulet <alexandre.becoulet@free.fr> (c) 2014

*/

#include <hexo/types.h>
#include <hexo/endian.h>
#include <hexo/iospace.h>
#include <hexo/bit.h>

#include <mutek/mem_alloc.h>
#include <arch/efm32/cmu.h>
#include <arch/efm32/devaddr.h>
#include <arch/efm32/clock.h>
#include <cpu/arm32m/v7m.h>

#include <device/resources.h>
#include <device/device.h>
#include <device/irq.h>
#include <device/class/cmu.h>

typedef UINT_FIT_TYPE(1ULL << (EFM32_CLOCK_count - 1)) efm32_clock_mask_t;
#define EFM32_CLK_MASK(x) ((efm32_clock_mask_t)1 << (x))

#define EFM32_CLOCK_HFCORECLK_CHILDMASK \
  ((EFM32_CLK_MASK(EFM32_CLOCK_HFCORECLK_last - EFM32_CLOCK_HFCORECLK_first + 1) - 1) \
   << EFM32_CLOCK_HFCORECLK_first)

#define EFM32_CLOCK_HFPERCLK_CHILDMASK \
  ((EFM32_CLK_MASK(EFM32_CLOCK_HFPERCLK_last - EFM32_CLOCK_HFPERCLK_first + 1) - 1) \
   << EFM32_CLOCK_HFPERCLK_first)

#define EFM32_CLOCK_LFACLK_CHILDMASK \
  ((EFM32_CLK_MASK(EFM32_CLOCK_LFACLK_last - EFM32_CLOCK_LFACLK_first + 1) - 1) \
   << EFM32_CLOCK_LFACLK_first)

#define EFM32_CLOCK_LFBCLK_CHILDMASK \
  ((EFM32_CLK_MASK(EFM32_CLOCK_LFBCLK_last - EFM32_CLOCK_LFBCLK_first + 1) - 1) \
   << EFM32_CLOCK_LFBCLK_first)

static const efm32_clock_mask_t efm32_clock_em1_mask =
  ((EFM32_CLOCK_HFCORECLK_CHILDMASK |
    EFM32_CLOCK_HFPERCLK_CHILDMASK)
   & ~(
#ifdef CONFIG_DRIVER_EFM32_GPIO
       /* allow em2+ when gpio clock is enabled. Disabling HFPERCLK
          when the cpu is idle is ok for pin irq. It is only used to
          access gpio registers when the cpu is running. */
       EFM32_CLK_MASK(EFM32_CLOCK_GPIO) |
#endif
       EFM32_CLK_MASK(EFM32_CLOCK_CPU)));

  /* EFM32_CLOCK_HFCORECLK and EFM32_CLOCK_HFCLK always enabled */
static const efm32_clock_mask_t efm32_clock_alwayson_mask = 
  EFM32_CLK_MASK(EFM32_CLOCK_HFCLK) | EFM32_CLK_MASK(EFM32_CLOCK_HFCORECLK) |
  EFM32_CLK_MASK(EFM32_CLOCK_CPU)

#ifdef CONFIG_MUTEK_PRINTK
# ifdef CONFIG_DRIVER_EFM32_LEUART_PRINTK
  /* hack to keep leuart clock enabled for early console before the
     leuart driver is loaded. */
#  if defined(EFM32_CLOCK_LEUART0) && CONFIG_MUTEK_PRINTK_ADDR == 0x40084000
  | EFM32_CLK_MASK(EFM32_CLOCK_LEUART0);
#  elif defined(EFM32_CLOCK_LEUART1) && CONFIG_MUTEK_PRINTK_ADDR == 0x40084400
  | EFM32_CLK_MASK(EFM32_CLOCK_LEUART1);
#  endif
# endif

# ifdef CONFIG_DRIVER_EFM32_USART_PRINTK
  /* hack to keep usart clock enabled for early console before the
     usart driver is loaded. */
#  if defined(EFM32_CLOCK_UART0) && CONFIG_MUTEK_PRINTK_ADDR == 0x4000e000
  | EFM32_CLK_MASK(EFM32_CLOCK_UART0);
#  elif defined(EFM32_CLOCK_UART1) && CONFIG_MUTEK_PRINTK_ADDR == 0x4000e400
  | EFM32_CLK_MASK(EFM32_CLOCK_UART1);
#  elif defined(EFM32_CLOCK_USART0) && CONFIG_MUTEK_PRINTK_ADDR == 0x4000c000
  | EFM32_CLK_MASK(EFM32_CLOCK_USART0);
#  elif defined(EFM32_CLOCK_USART1) && CONFIG_MUTEK_PRINTK_ADDR == 0x4000c400
  | EFM32_CLK_MASK(EFM32_CLOCK_USART1);
#  elif defined(EFM32_CLOCK_USART2) && CONFIG_MUTEK_PRINTK_ADDR == 0x4000c800
  | EFM32_CLK_MASK(EFM32_CLOCK_USART2);
#  endif
# endif
#endif
  ;

#ifdef CONFIG_DRIVER_EFM32_RECMU_NAMES
static const char * const efm32_clock_names[EFM32_CLOCK_count] = {
    [EFM32_CLOCK_HFXO]       = "hfxo",
    [EFM32_CLOCK_HFRCO]      = "hfrco",
# ifdef EFM32_CLOCK_AUXHFRCO
    [EFM32_CLOCK_AUXHFRCO]   = "auxhfrco",
# endif
    [EFM32_CLOCK_HFCLK]      = "hfclk",     
    [EFM32_CLOCK_HFCLKDIV]   = "hfclkdiv",
    [EFM32_CLOCK_HFCORECLK]  = "hfcoreclk",
    [EFM32_CLOCK_HFPERCLK]   = "hfperclk",
    [EFM32_CLOCK_LE]         = "le",        
    [EFM32_CLOCK_LFACLK]     = "lfaclk",    
    [EFM32_CLOCK_LFBCLK]     = "lfbclk",    
    [EFM32_CLOCK_LFXO]       = "lfxo",      
    [EFM32_CLOCK_LFRCO]      = "lfrco",     
    [EFM32_CLOCK_ULFRCO]     = "ulfrco",    
    [EFM32_CLOCK_OUT0]       = "out0",      
    [EFM32_CLOCK_OUT1]       = "out1",      
    [EFM32_CLOCK_CPU]        = "cpu",
# ifdef EFM32_CLOCK_AES
    [EFM32_CLOCK_AES]        = "aes",
# endif
# ifdef EFM32_CLOCK_DMA
    [EFM32_CLOCK_DMA]        = "dma",
# endif
# ifdef EFM32_CLOCK_EBI
    [EFM32_CLOCK_EBI]        = "ebi",
# endif
# ifdef EFM32_CLOCK_USB
    [EFM32_CLOCK_USB]        = "usb",
# endif
# ifdef EFM32_CLOCK_USBC
    [EFM32_CLOCK_USBC]       = "usbc",
# endif
# ifdef EFM32_CLOCK_TIMER0
    [EFM32_CLOCK_TIMER0]     = "timer0",
# endif
# ifdef EFM32_CLOCK_TIMER1
    [EFM32_CLOCK_TIMER1]     = "timer1",
# endif
# ifdef EFM32_CLOCK_TIMER2
    [EFM32_CLOCK_TIMER2]     = "timer2",
# endif
# ifdef EFM32_CLOCK_TIMER3
    [EFM32_CLOCK_TIMER3]     = "timer3",
# endif
# ifdef EFM32_CLOCK_USART0
    [EFM32_CLOCK_USART0]     = "usart0",
# endif
# ifdef EFM32_CLOCK_USART1
    [EFM32_CLOCK_USART1]     = "usart1",
# endif
# ifdef EFM32_CLOCK_USART2
    [EFM32_CLOCK_USART2]     = "usart2",
# endif
# ifdef EFM32_CLOCK_I2C0
    [EFM32_CLOCK_I2C0]       = "i2c0",
# endif
# ifdef EFM32_CLOCK_I2C1
    [EFM32_CLOCK_I2C1]       = "i2c1",
# endif
# ifdef EFM32_CLOCK_GPIO
    [EFM32_CLOCK_GPIO]       = "gpio",
# endif
# ifdef EFM32_CLOCK_ADC0
    [EFM32_CLOCK_ADC0]       = "adc0",
# endif
# ifdef EFM32_CLOCK_VCMP
    [EFM32_CLOCK_VCMP]       = "vcmp",
# endif
# ifdef EFM32_CLOCK_PRS
    [EFM32_CLOCK_PRS]        = "prs",
# endif
# ifdef EFM32_CLOCK_ACMP0
    [EFM32_CLOCK_ACMP0]      = "acmp0",
# endif
# ifdef EFM32_CLOCK_ACMP1
    [EFM32_CLOCK_ACMP1]      = "acmp1",
# endif
# ifdef EFM32_CLOCK_LESENSE
    [EFM32_CLOCK_LESENSE]    = "lesense",
# endif
# ifdef EFM32_CLOCK_RTC
    [EFM32_CLOCK_RTC]        = "rtc",
# endif
# ifdef EFM32_CLOCK_LETIMER
    [EFM32_CLOCK_LETIMER]    = "letimer",
# endif
# ifdef EFM32_CLOCK_LCD
    [EFM32_CLOCK_LCD]        = "lcd",
# endif
# ifdef EFM32_CLOCK_LEUART0
    [EFM32_CLOCK_LEUART0]    = "leuart0",
# endif
# ifdef EFM32_CLOCK_LEUART1
    [EFM32_CLOCK_LEUART1]    = "leuart1",
# endif
# ifdef EFM32_CLOCK_UART0
    [EFM32_CLOCK_UART0]      = "uart0",
# endif
# ifdef EFM32_CLOCK_UART1
    [EFM32_CLOCK_UART1]      = "uart1",
# endif
};
#endif

