AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
static const uint8_t efm32_en_bits[EFM32_CLOCK_count] = {
    [EFM32_CLOCK_LE]       = EFM32_CMU_HFCORECLKEN0_LE_SHIFT | 0x80,
    [EFM32_CLOCK_HFPERCLK] = EFM32_CMU_HFPERCLKDIV_HFPERCLKEN_SHIFT | 0x80,
#ifdef EFM32_CLOCK_AES
    [EFM32_CLOCK_AES]      = EFM32_CMU_HFCORECLKEN0_AES_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_DMA
    [EFM32_CLOCK_DMA]      = EFM32_CMU_HFCORECLKEN0_DMA_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_EBI
    [EFM32_CLOCK_EBI]      = EFM32_CMU_HFCORECLKEN0_EBI_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_USB
    [EFM32_CLOCK_USB]      = EFM32_CMU_HFCORECLKEN0_USB_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_TIMER0
    [EFM32_CLOCK_TIMER0]   = EFM32_CMU_HFPERCLKEN0_TIMER0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_TIMER1
    [EFM32_CLOCK_TIMER1]   = EFM32_CMU_HFPERCLKEN0_TIMER1_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_TIMER2
    [EFM32_CLOCK_TIMER2]   = EFM32_CMU_HFPERCLKEN0_TIMER2_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_TIMER3
    [EFM32_CLOCK_TIMER3]   = EFM32_CMU_HFPERCLKEN0_TIMER3_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_USART0
    [EFM32_CLOCK_USART0]   = EFM32_CMU_HFPERCLKEN0_USART0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_USART1
    [EFM32_CLOCK_USART1]   = EFM32_CMU_HFPERCLKEN0_USART1_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_USART2
    [EFM32_CLOCK_USART2]   = EFM32_CMU_HFPERCLKEN0_USART2_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_I2C0
    [EFM32_CLOCK_I2C0]     = EFM32_CMU_HFPERCLKEN0_I2C0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_I2C1
    [EFM32_CLOCK_I2C1]     = EFM32_CMU_HFPERCLKEN0_I2C1_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_GPIO
    [EFM32_CLOCK_GPIO]     = EFM32_CMU_HFPERCLKEN0_GPIO_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_ADC0
    [EFM32_CLOCK_ADC0]     = EFM32_CMU_HFPERCLKEN0_ADC0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_VCMP
    [EFM32_CLOCK_VCMP]     = EFM32_CMU_HFPERCLKEN0_VCMP_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_PRS
    [EFM32_CLOCK_PRS]      = EFM32_CMU_HFPERCLKEN0_PRS_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_ACMP0
    [EFM32_CLOCK_ACMP0]    = EFM32_CMU_HFPERCLKEN0_ACMP0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_ACMP1
    [EFM32_CLOCK_ACMP1]    = EFM32_CMU_HFPERCLKEN0_ACMP1_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_LESENSE
    [EFM32_CLOCK_LESENSE]  = EFM32_CMU_LFACLKEN0_LESENSE_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_RTC
    [EFM32_CLOCK_RTC]      = EFM32_CMU_LFACLKEN0_RTC_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_LETIMER
    [EFM32_CLOCK_LETIMER]  = EFM32_CMU_LFACLKEN0_LETIMER0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_LCD
    [EFM32_CLOCK_LCD]      = EFM32_CMU_LFACLKEN0_LCD_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_LEUART0
    [EFM32_CLOCK_LEUART0]  = EFM32_CMU_LFBCLKEN0_LEUART0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_LEUART1
    [EFM32_CLOCK_LEUART1]  = EFM32_CMU_LFBCLKEN0_LEUART1_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_UART0
    [EFM32_CLOCK_UART0]  = EFM32_CMU_HFPERCLKEN0_UART0_SHIFT | 0x80,
#endif
#ifdef EFM32_CLOCK_UART1
    [EFM32_CLOCK_UART1]  = EFM32_CMU_HFPERCLKEN0_UART1_SHIFT | 0x80,
#endif
};

DRIVER_PV(struct efm32_recmu_private_s
{
  struct dev_clock_src_ep_s src[EFM32_CLOCK_EP_COUNT];

  struct dev_freq_s hfxo_freq;
  struct dev_freq_s lfxo_freq;

  enum efm32_clock_node_e hfclk_parent:8;
  enum efm32_clock_node_e hfclk_new_parent:8;

  enum efm32_clock_node_e lfaclk_parent:8;
  enum efm32_clock_node_e lfaclk_new_parent:8;

  enum efm32_clock_node_e lfbclk_parent:8;
  enum efm32_clock_node_e lfbclk_new_parent:8;

#ifdef EFM32_CLOCK_USBC
  enum efm32_clock_node_e usbcclk_parent:8;
  enum efm32_clock_node_e usbcclk_new_parent:8;
#endif

  bool_t busy;

  efm32_clock_mask_t use_mask;   /* what is enabled by direct use */
  efm32_clock_mask_t link_mask;  /* what has a linked endpoint */
  efm32_clock_mask_t dep_mask;   /* what is enabled, including dependencies */
  efm32_clock_mask_t wait_mask;

#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
  efm32_clock_mask_t chg_mask;   /* what clock signal have their config changed */
  efm32_clock_mask_t notify_mask; /* source ep with notification enabled */
#endif

  uint32_t lfclksel;            /* mux value of lfclksel (without gating) */

  /** registers used for next config */
  uint32_t r_ctrl;
  uint32_t r_hfcoreclkdiv;
  uint32_t r_hfperclkdiv;
  uint32_t r_hfrcoctrl;
  uint32_t r_lfrcoctrl;
  uint32_t r_auxhfrcoctrl;
  uint32_t r_cmd;
  uint32_t r_lfclksel;
  uint32_t r_lfapresc0;
  uint32_t r_lfbpresc0;
});

static error_t
efm32_recmu_get_node_freq(struct efm32_recmu_private_s *pv,
                          struct dev_freq_s *freq,
                          dev_cmu_node_id_t node)
{
  uint32_t div;

  /* get divider and parent of lower nodes */
  switch (node)
    {
      /* LFACLK childs */
#ifdef EFM32_CLOCK_RTC
    case EFM32_CLOCK_RTC:
      node = EFM32_CLOCK_LFACLK;
      div = 1 << EFM32_CMU_LFAPRESC0_RTC_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR)));
      break;
#endif

#ifdef EFM32_CLOCK_LCD
    case EFM32_CLOCK_LCD:
      node = EFM32_CLOCK_LFACLK;
      div = 16 << EFM32_CMU_LFAPRESC0_LCD_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR)));
      break;
#endif

#ifdef EFM32_CLOCK_LETIMER
    case EFM32_CLOCK_LETIMER:
      node = EFM32_CLOCK_LFACLK;
      div = 1 << EFM32_CMU_LFAPRESC0_LETIMER0_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR)));
      break;
#endif

#ifdef EFM32_CLOCK_LESENSE
    case EFM32_CLOCK_LESENSE:
      node = EFM32_CLOCK_LFACLK;
      div = 1 << EFM32_CMU_LFAPRESC0_LESENSE_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR)));
      break;
#endif

      /* LFBCLK childs */
#ifdef EFM32_CLOCK_LEUART0
    case EFM32_CLOCK_LEUART0:
      node = EFM32_CLOCK_LFBCLK;
      div = 1 << EFM32_CMU_LFBPRESC0_LEUART0_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFBPRESC0_ADDR)));
      break;
#endif

#ifdef EFM32_CLOCK_LEUART1
    case EFM32_CLOCK_LEUART1:
      node = EFM32_CLOCK_LFBCLK;
      div = 1 << EFM32_CMU_LFBPRESC0_LEUART1_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFBPRESC0_ADDR)));
      break;
#endif

#ifdef EFM32_CLOCK_USBC
    case EFM32_CLOCK_USBC:
      node = pv->usbcclk_parent;
      div = 1;
      break;
#endif

    default:
      /* HFCORECLK & childs */
      if (EFM32_CLK_MASK(node) & (EFM32_CLOCK_HFCORECLK_CHILDMASK | EFM32_CLK_MASK(EFM32_CLOCK_HFCORECLK)))
        {
          node = EFM32_CLOCK_HFCLKDIV;
          div = 1 << EFM32_CMU_HFCORECLKDIV_HFCORECLKDIV_GET(endian_le32(
            cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKDIV_ADDR)));
        }

      /* HFPERCLK & childs */
      else if (EFM32_CLK_MASK(node) & (EFM32_CLOCK_HFPERCLK_CHILDMASK | EFM32_CLK_MASK(EFM32_CLOCK_HFPERCLK)))
        {
          node = EFM32_CLOCK_HFCLKDIV;
          div = 1 << EFM32_CMU_HFPERCLKDIV_HFPERCLKDIV_GET(endian_le32(
            cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFPERCLKDIV_ADDR)));
        }

