AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
      /* not a lower node */
      else
        {
          div = 1;
        }
      break;
    }

  /* get divider and parent of intermediate nodes */
  switch (node)
    {
    case EFM32_CLOCK_HFCLKDIV:
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO)
      div *= EFM32_CMU_CTRL_HFCLKDIV_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_CTRL_ADDR))) + 1;
# endif
    case EFM32_CLOCK_HFCLK:
      node = pv->hfclk_parent;
      break;

    case EFM32_CLOCK_LFACLK:
      node = pv->lfaclk_parent;
      break;
    case EFM32_CLOCK_LFBCLK:
      node = pv->lfbclk_parent;
      break;

    default:
      break;
    }

  /* compute frequency of root nodes */
  switch (node)
    {
    case EFM32_CLOCK_LE:
      if (efm32_recmu_get_node_freq(pv, freq, EFM32_CLOCK_HFCORECLK))
        return -EINVAL;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_ZERO_GECKO)
      div *= 2 << EFM32_CMU_HFCORECLKDIV_HFCORECLKLEDIV_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKDIV_ADDR)));
# else
      div *= 2;
# endif
      break;

    case EFM32_CLOCK_HFXO:
      *freq = pv->hfxo_freq;
      break;

    case EFM32_CLOCK_LFXO:
      *freq = pv->lfxo_freq;
      break;

    case EFM32_CLOCK_HFRCO: {
      static const uint8_t hfrcoband[8] = { 1, 7, 11, 14, 21, 28 };
      freq->denom = 1;
      freq->num = hfrcoband[EFM32_CMU_HFRCOCTRL_BAND_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFRCOCTRL_ADDR)))] * 1000000;
      dev_freq_acc_set(freq, 4, 27); /* 1% */
      break;
    }

#ifdef EFM32_CLOCK_AUXHFRCO
    case EFM32_CLOCK_AUXHFRCO: {
      static const uint8_t auxfrcoband[8] = { 14, 11, 7, 1, 0, 0, 28, 21 };
      freq->denom = 1;
      freq->num = auxfrcoband[EFM32_CMU_AUXHFRCOCTRL_BAND_GET(endian_le32(
        cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_AUXHFRCOCTRL_ADDR)))] * 1000000;
      dev_freq_acc_set(freq, 4, 27); /* 1% */
      break;
    }
#endif

    case EFM32_CLOCK_LFRCO:
      freq->denom = 1;
      freq->num = 32768;
      dev_freq_acc_set(freq, 4, 27); /* 1% */
      break;

    case EFM32_CLOCK_ULFRCO:
      freq->denom = 1;
      freq->num = 1000;
      dev_freq_acc_set(freq, 4, 27); /* 1% */
      break;

    default:
      return -ENOTSUP;
    }

  freq->denom *= div;

  if (!freq->num || !freq->denom)
    return -EINVAL;

  if (freq->denom > 1)
    {
      uint64_t g = gcd64(freq->num, freq->denom);
      freq->num /= g;
      freq->denom /= g;
    }

  return 0;
}

static DEV_CMU_CONFIG_OSC(efm32_recmu_config_osc)
{
  struct device_s *dev = accessor->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  if (pv->busy)
    return -EBUSY;

  /* oscilator nodes */
  switch (node_id)
    {
    case EFM32_CLOCK_HFRCO: {
      switch (freq->denom)
        {
        case 1:
          break;
        case 0:
          return 0;
        default:
          return -ENOTSUP;
        }
      switch (freq->num)
        {
        case 0:
          break;
        case 1000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 1MHZ);
          break;
        case 7000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 7MHZ);
          break;
        case 11000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 11MHZ);
          break;
        case 14000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 14MHZ);
          break;
        case 21000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 21MHZ);
          break;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_GECKO)
        case 28000000:
          EFM32_CMU_HFRCOCTRL_BAND_SET(pv->r_hfrcoctrl, 28MHZ);
          break;
# endif
        default:
          return -ENOTSUP;
        }
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
      pv->chg_mask |= EFM32_CLK_MASK(node_id);
#endif
      return 0;
    }

# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_ZERO_GECKO)
    case EFM32_CLOCK_AUXHFRCO: {
      switch (freq->denom)
        {
        case 1:
          break;
        case 0:
          return 0;
        default:
          return -ENOTSUP;
        }
      switch (freq->num)
        {
        case 0:
          break;
        case 1000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 1MHZ);
          break;
        case 7000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 7MHZ);
          break;
        case 11000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 11MHZ);
          break;
        case 14000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 14MHZ);
          break;
        case 21000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 21MHZ);
          break;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO)
        case 28000000:
          EFM32_CMU_AUXHFRCOCTRL_BAND_SET(pv->r_auxhfrcoctrl, 28MHZ);
          break;
# endif
        default:
          return -ENOTSUP;
        }
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
      pv->chg_mask |= EFM32_CLK_MASK(node_id);
#endif
      return 0;
    }
#endif

    case EFM32_CLOCK_HFXO:
      pv->hfxo_freq = *freq;
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
      pv->chg_mask |= EFM32_CLK_MASK(node_id);
#endif
      return 0;

    case EFM32_CLOCK_LFXO:
      pv->lfxo_freq = *freq;
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
      pv->chg_mask |= EFM32_CLK_MASK(node_id);
#endif
      return 0;

    case EFM32_CLOCK_LFRCO:
    case EFM32_CLOCK_ULFRCO:
      switch (freq->denom)
        {
        case 0:
          return 0;
        default:
          return -ENOTSUP;
        }

    default:
      return -ENOENT;
    }
}

static DEV_CMU_CONFIG_MUX(efm32_recmu_config_mux)
{
  struct device_s *dev = accessor->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  if (pv->busy)
    return -EBUSY;

