AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
  if (ratio->num != 1 || !is_pow2(ratio->denom))
    return -EINVAL;

  switch (node_id)
    {
    case EFM32_CLOCK_HFCLK: {
      if (ratio->denom != 1)
        return -ENOTSUP;
      switch (parent_id)
        {
        case EFM32_CLOCK_HFRCO:
          EFM32_CMU_CMD_HFCLKSEL_SET(pv->r_cmd, HFRCO);
          break;
        case EFM32_CLOCK_HFXO:
          EFM32_CMU_CMD_HFCLKSEL_SET(pv->r_cmd, HFXO);
          break;
        case EFM32_CLOCK_LFRCO:
          EFM32_CMU_CMD_HFCLKSEL_SET(pv->r_cmd, LFRCO);
          break;
        case EFM32_CLOCK_LFXO:
          EFM32_CMU_CMD_HFCLKSEL_SET(pv->r_cmd, HFRCO);
          break;
        default:
          return -ENOTSUP;
        }
      pv->hfclk_new_parent = parent_id;
      break;
    }

# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO)
    case EFM32_CLOCK_HFCLKDIV:
      if (parent_id != EFM32_CLOCK_HFCLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 8)
            return -ENOTSUP;
          EFM32_CMU_CTRL_HFCLKDIV_SET(pv->r_ctrl, d + 1);
        }
      break;
#endif

    case EFM32_CLOCK_HFCORECLK: {
      if (parent_id != EFM32_CLOCK_HFCLKDIV)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 512)
            return -ENOTSUP;
          EFM32_CMU_HFCORECLKDIV_HFCORECLKDIV_SETVAL(pv->r_hfcoreclkdiv, __FFS(d) - 1);
        }
      break;
    }

    case EFM32_CLOCK_HFPERCLK: {
      if (parent_id != EFM32_CLOCK_HFCLKDIV)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 512)
            return -ENOTSUP;
          EFM32_CMU_HFPERCLKDIV_HFPERCLKDIV_SETVAL(pv->r_hfperclkdiv, __FFS(d) - 1);
        }
      break;
    }

    case EFM32_CLOCK_LE: {
      if (parent_id != EFM32_CLOCK_HFCORECLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_ZERO_GECKO)
          if (d != 2 && d != 4)
            return -ENOTSUP;
          EFM32_CMU_HFCORECLKDIV_HFCORECLKLEDIV_SETVAL(pv->r_hfcoreclkdiv, d == 4);
#else
          if (d != 2)
            return -ENOTSUP;
#endif
        }
      break;
    }

#ifdef EFM32_CLOCK_USBC
    case EFM32_CLOCK_USBC: {
      if (ratio->denom != 1)
        return -ENOTSUP;
      switch (parent_id)
        {
        case EFM32_CLOCK_LFXO:
          EFM32_CMU_CMD_USBCCLKSEL_SET(pv->r_cmd, LFXO);
          break;
        case EFM32_CLOCK_LFRCO:
          EFM32_CMU_CMD_USBCCLKSEL_SET(pv->r_cmd, LFRCO);
          break;
        case EFM32_CLOCK_HFCLK:
          EFM32_CMU_CMD_USBCCLKSEL_SET(pv->r_cmd, HFCLKNODIV);
          break;
        default:
          return -ENOTSUP;
        }
      pv->usbcclk_new_parent = parent_id;
      break;
    }
#endif

    case EFM32_CLOCK_LFACLK: {
      if (ratio->denom != 1)
        return -ENOTSUP;
      switch (parent_id)
        {
        case EFM32_CLOCK_LE:
          EFM32_CMU_LFCLKSEL_LFA_SET(pv->r_lfclksel, HFCORECLKLEDIV2);
          break;
        case EFM32_CLOCK_LFXO:
          EFM32_CMU_LFCLKSEL_LFA_SET(pv->r_lfclksel, LFXO);
          break;
        case EFM32_CLOCK_LFRCO:
          EFM32_CMU_LFCLKSEL_LFA_SET(pv->r_lfclksel, LFRCO);
          break;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_ZERO_GECKO)
        case EFM32_CLOCK_ULFRCO:
          EFM32_CMU_LFCLKSEL_LFA_SET(pv->r_lfclksel, DISABLED_OR_ULFRCO);
          EFM32_CMU_LFCLKSEL_LFAE_SET(pv->r_lfclksel, ULFRCO);
          break;
# endif
        default:
          return -ENOTSUP;
        }
      pv->lfaclk_new_parent = parent_id;
      break;
    }

    case EFM32_CLOCK_LFBCLK: {
      if (ratio->denom != 1)
        return -ENOTSUP;
      switch (parent_id)
        {
        case EFM32_CLOCK_LE:
          EFM32_CMU_LFCLKSEL_LFB_SET(pv->r_lfclksel, HFCORECLKLEDIV2);
          break;
        case EFM32_CLOCK_LFXO:
          EFM32_CMU_LFCLKSEL_LFB_SET(pv->r_lfclksel, LFXO);
          break;
        case EFM32_CLOCK_LFRCO:
          EFM32_CMU_LFCLKSEL_LFB_SET(pv->r_lfclksel, LFRCO);
          break;
# if defined(CONFIG_EFM32_LEOPARD_GECKO) \
  || defined(CONFIG_EFM32_WONDER_GECKO) \
  || defined(CONFIG_EFM32_GIANT_GECKO) \
  || defined(CONFIG_EFM32_ZERO_GECKO)
        case EFM32_CLOCK_ULFRCO:
          EFM32_CMU_LFCLKSEL_LFB_SET(pv->r_lfclksel, DISABLED_OR_ULFRCO);
          EFM32_CMU_LFCLKSEL_LFBE_SET(pv->r_lfclksel, ULFRCO);
          break;
# endif
        default:
          return -ENOTSUP;
        }
      pv->lfbclk_new_parent = parent_id;
      break;
    }

#ifdef EFM32_CLOCK_LESENSE
    case EFM32_CLOCK_LESENSE:
      if (parent_id != EFM32_CLOCK_LFACLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 8)
            return -ENOTSUP;
          EFM32_CMU_LFAPRESC0_LESENSE_SETVAL(pv->r_lfapresc0, __FFS(d) - 1);
        }
      break;
#endif

#ifdef EFM32_CLOCK_RTC
    case EFM32_CLOCK_RTC:
      if (parent_id != EFM32_CLOCK_LFACLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 32768)
            return -ENOTSUP;
          EFM32_CMU_LFAPRESC0_RTC_SETVAL(pv->r_lfapresc0, __FFS(d) - 1);
        }
      break;
#endif

#ifdef EFM32_CLOCK_LETIMER
    case EFM32_CLOCK_LETIMER:
      if (parent_id != EFM32_CLOCK_LFACLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 32768)
            return -ENOTSUP;
          EFM32_CMU_LFAPRESC0_LETIMER0_SETVAL(pv->r_lfapresc0, __FFS(d) - 1);
        }
      break;
#endif

#ifdef EFM32_CLOCK_LCD
    case EFM32_CLOCK_LCD:
      if (parent_id != EFM32_CLOCK_LFACLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d < 16)
            return -ENOTSUP;
          EFM32_CMU_LFAPRESC0_LCD_SETVAL(pv->r_lfapresc0, __FFS(d) - 5);
        }
      break;
#endif

#ifdef EFM32_CLOCK_LEUART0
    case EFM32_CLOCK_LEUART0:
      if (parent_id != EFM32_CLOCK_LFBCLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 8)
            return -ENOTSUP;
          EFM32_CMU_LFBPRESC0_LEUART0_SETVAL(pv->r_lfbpresc0, __FFS(d) - 1);
        }
      break;
#endif

#ifdef EFM32_CLOCK_LEUART1
    case EFM32_CLOCK_LEUART1:
      if (parent_id != EFM32_CLOCK_LFBCLK)
        return -ENOTSUP;
        {
          uint32_t d = ratio->denom;
          if (d > 8)
            return -ENOTSUP;
          EFM32_CMU_LFBPRESC0_LEUART1_SETVAL(pv->r_lfbpresc0, __FFS(d) - 1);
        }
      break;
#endif

    default:
      return -ENOENT;
    }

#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
  pv->chg_mask |= EFM32_CLK_MASK(node_id);
#endif
  return 0;
}

static void efm32_recmu_clock_wait(struct efm32_recmu_private_s *pv)
{
  uint32_t x = 0;

#ifdef EFM32_CLOCK_AUXHFRCO
  if (pv->wait_mask & EFM32_CLK_MASK(EFM32_CLOCK_AUXHFRCO))
    x |= EFM32_CMU_STATUS_AUXHFRCORDY;
#endif
  if (pv->wait_mask & EFM32_CLK_MASK(EFM32_CLOCK_HFXO))
    x |= EFM32_CMU_STATUS_HFXORDY;
  if (pv->wait_mask & EFM32_CLK_MASK(EFM32_CLOCK_LFXO))
    x |= EFM32_CMU_STATUS_LFXORDY;
  if (pv->wait_mask & EFM32_CLK_MASK(EFM32_CLOCK_HFRCO))
    x |= EFM32_CMU_STATUS_HFRCORDY;
  if (pv->wait_mask & EFM32_CLK_MASK(EFM32_CLOCK_LFRCO))
    x |= EFM32_CMU_STATUS_LFRCORDY;

  while ((endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR +
                                      EFM32_CMU_STATUS_ADDR)) & x) != x)
    ;

  pv->wait_mask = 0;
}

struct efm32_recmu_deps_s
{
  efm32_clock_mask_t child_mask;
  enum efm32_clock_node_e node;
  uintptr_t addr;
};

static const struct efm32_recmu_deps_s efm32_recmu_deps[4] = {
  { EFM32_CLOCK_LFACLK_CHILDMASK,    EFM32_CLOCK_LFACLK,    EFM32_CMU_LFACLKEN0_ADDR },
  { EFM32_CLOCK_LFBCLK_CHILDMASK,    EFM32_CLOCK_LFBCLK,    EFM32_CMU_LFBCLKEN0_ADDR },
  { EFM32_CLOCK_HFPERCLK_CHILDMASK,  EFM32_CLOCK_HFPERCLK,  EFM32_CMU_HFPERCLKEN0_ADDR },
  { EFM32_CLOCK_HFCORECLK_CHILDMASK, EFM32_CLOCK_HFCORECLK, EFM32_CMU_HFCORECLKEN0_ADDR },
};

static void efm32_recmu_clock_gate(struct efm32_recmu_private_s *pv,
                                   efm32_clock_mask_t mask)
{
  mask |= efm32_clock_alwayson_mask;
  efm32_clock_mask_t m = mask ^ pv->dep_mask;

  uint_fast8_t i;
  for (i = 0; i < 4; i++)
    {
      const struct efm32_recmu_deps_s *t = efm32_recmu_deps + i;

      efm32_clock_mask_t q = m & t->child_mask;
      if (!q)
        continue;

      /* enable/disable peripherals clocks */
      pv->dep_mask ^= q;

      uint32_t x = cpu_mem_read_32(EFM32_CMU_ADDR + t->addr);
      while (q)
        {
          dev_cmu_node_id_t id = __FFS(q) - 1;
          uint8_t s = efm32_en_bits[id];
          if (s & 0x80)
            {
              s &= 0x7f;
              if ((mask >> id) & 1)
                x |= endian_le32(1 << s);
              else
                x &= ~endian_le32(1 << s);
            }

