AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
          q = q & (q - 1);  /* clear rightmost bit set */
        }
      cpu_mem_write_32(EFM32_CMU_ADDR + t->addr, x);
    }
}

static void efm32_recmu_clock_dep(struct efm32_recmu_private_s *pv,
                                  efm32_clock_mask_t mask)
{
  mask |= efm32_clock_alwayson_mask | EFM32_CLK_MASK(pv->hfclk_parent);

  uint_fast8_t i;
  for (i = 0; i < 4; i++)
    {
      const struct efm32_recmu_deps_s *t = efm32_recmu_deps + i;
      if (mask & t->child_mask)
        mask |= EFM32_CLK_MASK(t->node);
    }

  efm32_clock_mask_t m = mask ^ pv->dep_mask;

  /* enable/disable EFM32_CLOCK_HFPERCLK */
  if (m & EFM32_CLK_MASK(EFM32_CLOCK_HFPERCLK))
    {
      uint32_t x = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFPERCLKDIV_ADDR));
      EFM32_CMU_HFPERCLKDIV_HFPERCLKEN_SET(x, (mask >> EFM32_CLOCK_HFPERCLK) & 1);
      cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFPERCLKDIV_ADDR, endian_le32(x));
    }

#ifdef EFM32_CLOCK_USBC
  /* enable/disable EFM32_CLOCK_USBC */
  if (m & EFM32_CLK_MASK(EFM32_CLOCK_USBC))
    {
      bool_t en = (mask >> EFM32_CLOCK_USBC) & 1;
      uint32_t x = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKEN0_ADDR));
      EFM32_CMU_HFCORECLKEN0_USBC_SET(x, en);
      cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKEN0_ADDR, endian_le32(x));
      if (en)
        mask |= EFM32_CLK_MASK(pv->usbcclk_parent);
    }
#endif

  /* enable/disable EFM32_CLOCK_LF*CLK */
  {
    uint32_t x = 0;

    if (mask & EFM32_CLK_MASK(EFM32_CLOCK_LFACLK))
      {
        x |= pv->lfclksel & 0x00010003;
        mask |= EFM32_CLK_MASK(pv->lfaclk_parent) | EFM32_CLK_MASK(EFM32_CLOCK_LE);
      }

    if (mask & EFM32_CLK_MASK(EFM32_CLOCK_LFBCLK))
      {
        x |= pv->lfclksel & 0x0010000c;
        mask |= EFM32_CLK_MASK(pv->lfbclk_parent) | EFM32_CLK_MASK(EFM32_CLOCK_LE);
      }

    cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_LFCLKSEL_ADDR, endian_le32(x));
  }

  pv->dep_mask ^= m & (EFM32_CLK_MASK(EFM32_CLOCK_HFPERCLK) |
#ifdef EFM32_CLOCK_USBC
                   EFM32_CLK_MASK(EFM32_CLOCK_USBC) |
#endif
                   EFM32_CLK_MASK(EFM32_CLOCK_LFACLK) |
                   EFM32_CLK_MASK(EFM32_CLOCK_LFBCLK));

  /***** root nodes */

  m = mask ^ pv->dep_mask;

  /* enable/disable EFM32_CLOCK_LE */
  if (m & EFM32_CLK_MASK(EFM32_CLOCK_LE))
    {
      uint32_t x = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKEN0_ADDR));
      EFM32_CMU_HFCORECLKEN0_LE_SET(x, (mask >> EFM32_CLOCK_LE) & 1);
      cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKEN0_ADDR, endian_le32(x));
      pv->dep_mask ^= EFM32_CLK_MASK(EFM32_CLOCK_LE);
    }

  /* enable/disable oscillators */
  m &= EFM32_CLK_MASK(EFM32_CLOCK_LFXO) | EFM32_CLK_MASK(EFM32_CLOCK_HFXO)
    | EFM32_CLK_MASK(EFM32_CLOCK_LFRCO) | EFM32_CLK_MASK(EFM32_CLOCK_HFRCO)
#ifdef EFM32_CLOCK_AUXHFRCO
    | EFM32_CLK_MASK(EFM32_CLOCK_AUXHFRCO)
#endif
    ;

  if (m)
    {
      efm32_clock_mask_t en = m & mask;
      efm32_clock_mask_t dis = m & ~mask;
      uint32_t cmd = 0;
#ifdef EFM32_CLOCK_AUXHFRCO
      EFM32_CMU_OSCENCMD_AUXHFRCOEN_SET(cmd,  (en  >> EFM32_CLOCK_AUXHFRCO) & 1);
      EFM32_CMU_OSCENCMD_AUXHFRCODIS_SET(cmd, (dis >> EFM32_CLOCK_AUXHFRCO) & 1);
#endif
      EFM32_CMU_OSCENCMD_LFXOEN_SET(cmd,   (en  >> EFM32_CLOCK_LFXO) & 1);
      EFM32_CMU_OSCENCMD_LFXODIS_SET(cmd,  (dis >> EFM32_CLOCK_LFXO) & 1);
      EFM32_CMU_OSCENCMD_LFRCOEN_SET(cmd,  (en  >> EFM32_CLOCK_LFRCO) & 1);
      EFM32_CMU_OSCENCMD_LFRCODIS_SET(cmd, (dis >> EFM32_CLOCK_LFRCO) & 1);
      EFM32_CMU_OSCENCMD_HFXOEN_SET(cmd,   (en  >> EFM32_CLOCK_HFXO) & 1);
      EFM32_CMU_OSCENCMD_HFXODIS_SET(cmd,  (dis >> EFM32_CLOCK_HFXO) & 1);
      EFM32_CMU_OSCENCMD_HFRCOEN_SET(cmd,  (en  >> EFM32_CLOCK_HFRCO) & 1);
      EFM32_CMU_OSCENCMD_HFRCODIS_SET(cmd, (dis >> EFM32_CLOCK_HFRCO) & 1);
      cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_OSCENCMD_ADDR, endian_le32(cmd));

      pv->wait_mask |= en;
      pv->dep_mask ^= m;
    }
}


static DEV_CMU_COMMIT(efm32_recmu_commit)
{
  struct device_s *dev = accessor->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  if (pv->busy)
    return -EBUSY;
  pv->busy = 1;

  pv->lfaclk_parent = pv->lfaclk_new_parent;
  pv->lfbclk_parent = pv->lfbclk_new_parent;
  pv->hfclk_parent = pv->hfclk_new_parent;

  /* Enable clocks from new config. Keep clocks from old config
     enabled. */
  efm32_recmu_clock_dep(pv, pv->dep_mask | pv->link_mask);
  efm32_recmu_clock_wait(pv);

  /* Write configuration to device registers */
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_CTRL_ADDR,
                  endian_le32(pv->r_ctrl));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKDIV_ADDR,
                  endian_le32(pv->r_hfcoreclkdiv));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFPERCLKDIV_ADDR,
                  endian_le32(pv->r_hfperclkdiv));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_HFRCOCTRL_ADDR,
                  endian_le32(pv->r_hfrcoctrl));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_LFRCOCTRL_ADDR,
                  endian_le32(pv->r_lfrcoctrl));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_AUXHFRCOCTRL_ADDR,
                  endian_le32(pv->r_auxhfrcoctrl));

    /* lf clocks use the config mux for gating, register will be
       updated in efm32_recmu_clock_dep. */
  pv->lfclksel = pv->r_lfclksel;

  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR,
                  endian_le32(pv->r_lfapresc0));
  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_LFBPRESC0_ADDR,
                  endian_le32(pv->r_lfbpresc0));

  cpu_mem_write_32(EFM32_CMU_ADDR + EFM32_CMU_CMD_ADDR,
                  endian_le32(pv->r_cmd));
  pv->r_cmd = 0;

  /* Disable unused clocks after mux update */
  efm32_recmu_clock_dep(pv, pv->link_mask);

#ifdef CONFIG_DRIVER_EFM32_RECMU_SLEEPDEEP
  /* SLEEPDEEP always restore HFRCO. */
  if (pv->hfclk_parent != EFM32_CLOCK_HFRCO)
    cpu_mem_write_32(ARMV7M_SCR_ADDR, 0);
#endif

#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
  /* propagate changes in tree */
  if ((pv->chg_mask >> pv->hfclk_new_parent) & 1)
    pv->chg_mask |= EFM32_CLK_MASK(EFM32_CLOCK_HFCLK)
      | EFM32_CLK_MASK(EFM32_CLOCK_HFCLKDIV)
      | EFM32_CLK_MASK(EFM32_CLOCK_HFPERCLK)
      | EFM32_CLK_MASK(EFM32_CLOCK_HFCORECLK)
      | EFM32_CLK_MASK(EFM32_CLOCK_LE)
      ;

  if ((pv->chg_mask >> pv->lfaclk_new_parent) & 1)
    pv->chg_mask |= EFM32_CLK_MASK(EFM32_CLOCK_LFACLK);

