AntoineMugnier/mutekh/arch/efm32/drivers/recmu/recmu.c
  if ((pv->chg_mask >> pv->lfbclk_new_parent) & 1)
    pv->chg_mask |= EFM32_CLK_MASK(EFM32_CLOCK_LFBCLK);

  if ((pv->chg_mask >> EFM32_CLOCK_HFCORECLK) & 1)
    pv->chg_mask |= EFM32_CLOCK_HFCORECLK_CHILDMASK;

  if ((pv->chg_mask >> EFM32_CLOCK_HFPERCLK) & 1)
    pv->chg_mask |= EFM32_CLOCK_HFPERCLK_CHILDMASK;

  if ((pv->chg_mask >> EFM32_CLOCK_LFACLK) & 1)
    pv->chg_mask |= EFM32_CLOCK_LFACLK_CHILDMASK;

  if ((pv->chg_mask >> EFM32_CLOCK_LFBCLK) & 1)
    pv->chg_mask |= EFM32_CLOCK_LFBCLK_CHILDMASK;

  /* iterate over changed source ep */
  efm32_clock_mask_t m = (pv->chg_mask & pv->notify_mask) >> EFM32_CLOCK_FIRST_EP;

  while (m)
    {
      dev_cmu_node_id_t id = __FFS(m) - 1;
      struct dev_clock_src_ep_s *src = pv->src + id;
      assert(src->notify_count);
      id += EFM32_CLOCK_FIRST_EP;

      struct dev_clock_notify_s notify;
      if (efm32_recmu_get_node_freq(pv, &notify.freq, id))
        abort();
      dev_cmu_src_notify(src, &notify);

      m = m & (m - 1);          /* clear lsb */
    }

  pv->chg_mask = 0;
#endif

  pv->busy = 0;

  return 0;
}

static void efm32_recmu_read_config(struct efm32_recmu_private_s *pv)
{
  pv->r_ctrl = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_CTRL_ADDR));
  pv->r_hfcoreclkdiv = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFCORECLKDIV_ADDR));
  pv->r_hfperclkdiv = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFPERCLKDIV_ADDR));
  pv->r_hfrcoctrl = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_HFRCOCTRL_ADDR));
  pv->r_lfrcoctrl = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFRCOCTRL_ADDR));
  pv->r_auxhfrcoctrl = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_AUXHFRCOCTRL_ADDR));
  pv->r_cmd = 0;
  pv->r_lfclksel = pv->lfclksel;
  pv->r_lfapresc0 = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFAPRESC0_ADDR));
  pv->r_lfbpresc0 = endian_le32(cpu_mem_read_32(EFM32_CMU_ADDR + EFM32_CMU_LFBPRESC0_ADDR));

#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
  pv->chg_mask = 0;
#endif
  pv->lfaclk_new_parent = pv->lfaclk_parent;
  pv->lfbclk_new_parent = pv->lfbclk_parent;
  pv->hfclk_new_parent = pv->hfclk_parent;
#ifdef EFM32_CLOCK_USBC
  pv->usbcclk_new_parent = pv->usbcclk_parent;
#endif
}

static DEV_CMU_ROLLBACK(efm32_recmu_rollback)
{
  struct device_s *dev = accessor->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  if (pv->busy)
    return -EBUSY;

  efm32_recmu_read_config(pv);

  return 0;
}

static DEV_CMU_NODE_INFO(efm32_recmu_node_info)
{
  struct device_s *dev = accessor->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  if (node_id >= EFM32_CLOCK_count)
    return -EINVAL;

  if (*mask & (DEV_CMU_INFO_FREQ | DEV_CMU_INFO_ACCURACY))
    if (efm32_recmu_get_node_freq(pv, &info->freq, node_id))
      *mask &= ~(DEV_CMU_INFO_FREQ | DEV_CMU_INFO_ACCURACY);

#ifdef CONFIG_DRIVER_EFM32_RECMU_NAMES
  info->name = efm32_clock_names[node_id];
#else
  *mask &= ~DEV_CMU_INFO_NAME;  
#endif

  info->running = (pv->dep_mask >> node_id) & 1;

  if (*mask & DEV_CMU_INFO_PARENT)
    switch (node_id)
      {
      case EFM32_CLOCK_HFCLK:
        info->parent_id = pv->hfclk_parent;
        break;
      case EFM32_CLOCK_LFACLK:
        info->parent_id = pv->lfaclk_parent;
        break;
      case EFM32_CLOCK_LFBCLK:
        info->parent_id = pv->lfbclk_parent;
        break;
#ifdef EFM32_CLOCK_USBC
      case EFM32_CLOCK_USBC:
        info->parent_id = pv->usbcclk_parent;
        break;
#endif
      default:
        *mask ^= DEV_CMU_INFO_PARENT;
        break;
      }

  *mask &= ~DEV_CMU_INFO_SINK;

  if (*mask & DEV_CMU_INFO_SRC)
    {
      if (node_id > EFM32_CLOCK_FIRST_EP)
        info->src = pv->src + node_id - EFM32_CLOCK_FIRST_EP;
      else
        *mask ^= DEV_CMU_INFO_SRC;
    }

  return 0;
}

static DEV_CLOCK_SRC_SETUP(efm32_recmu_ep_setup)
{
  struct device_s *dev = src->dev;
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  dev_cmu_node_id_t id = src - pv->src + EFM32_CLOCK_FIRST_EP;
  if (id >= EFM32_CLOCK_count)
    return -EINVAL;

  efm32_clock_mask_t mask = EFM32_CLK_MASK(id);

  switch (op)
    {
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
    case DEV_CLOCK_SRC_SETUP_NOTIFY:
      pv->notify_mask |= mask;
      return 0;
    case DEV_CLOCK_SRC_SETUP_NONOTIFY:
      pv->notify_mask &= ~mask;
      return 0;
#endif

    case DEV_CLOCK_SRC_SETUP_GATES:
      if (param->flags & DEV_CLOCK_EP_CLOCK)
        {
          pv->use_mask |= mask;
          efm32_recmu_clock_gate(pv, pv->use_mask);

#ifdef CONFIG_DRIVER_EFM32_RECMU_SLEEPDEEP
          /* disable SLEEPDEEP ? */
          if (mask & efm32_clock_em1_mask)
            cpu_mem_write_32(ARMV7M_SCR_ADDR, 0);
#endif
        }
      else
        {
          pv->use_mask &= ~mask;

#ifdef CONFIG_DRIVER_EFM32_RECMU_SLEEPDEEP
          /* delayed clock disable */
          device_sleep_schedule(dev);
#else
          efm32_recmu_clock_gate(pv, pv->use_mask);
#endif
        }

      dev_cmu_src_update_sync(src, param->flags);
      return 0;

    case DEV_CLOCK_SRC_SETUP_LINK:
      pv->link_mask |= mask;
      efm32_recmu_clock_dep(pv, pv->link_mask);
      efm32_recmu_clock_wait(pv);
      return 0;

    case DEV_CLOCK_SRC_SETUP_UNLINK:
      pv->link_mask &= ~mask;
      efm32_recmu_clock_dep(pv, pv->link_mask);
      return 0;

    default:
      return -ENOTSUP;
    }
}


static DEV_USE(efm32_recmu_use)
{
  switch (op)
    {
#ifdef CONFIG_DRIVER_EFM32_RECMU_SLEEPDEEP
    case DEV_USE_SLEEP: {
      struct device_s *dev = param;
      struct efm32_recmu_private_s *pv = dev->drv_pv;
      efm32_recmu_clock_gate(pv, pv->use_mask);

      if (pv->hfclk_parent == EFM32_CLOCK_HFRCO &&
          !(pv->dep_mask & efm32_clock_em1_mask))
        cpu_mem_write_32(ARMV7M_SCR_ADDR, ARMV7M_SCR_SLEEPDEEP);

      return 0;
    }
#endif

    default:
      return dev_use_generic(param, op);
    }
}

static DEV_INIT(efm32_recmu_init)
{
  struct efm32_recmu_private_s *pv;

  __unused__ uintptr_t addr = 0;
  assert(device_res_get_uint(dev, DEV_RES_MEM, 0, &addr, NULL) == 0 &&
         EFM32_RMU_ADDR == addr);

  assert(device_res_get_uint(dev, DEV_RES_MEM, 1, &addr, NULL) == 0 &&
         EFM32_EMU_ADDR == addr);

  assert(device_res_get_uint(dev, DEV_RES_MEM, 2, &addr, NULL) == 0 &&
         EFM32_CMU_ADDR == addr);


  pv = mem_alloc(sizeof (*pv), (mem_scope_sys));
  if (!pv)
    return -ENOMEM;

  memset(pv, 0, sizeof (*pv));

  dev_freq_acc_set(&pv->lfxo_freq, 4, 17); /* default to 100ppm */
  dev_freq_acc_set(&pv->hfxo_freq, 4, 17); /* default to 100ppm */
  dev->drv_pv = pv;

  uint_fast8_t i;
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
  /* find nodes which can have multiple clock sources with the
     defined set of resources. */
  efm32_clock_mask_t once, mult = 0, o;
  do {
    o = mult;
    once = 0;

    DEVICE_RES_FOREACH(dev, r, {
        switch (r->type)
          {
          case DEV_RES_CMU_MUX:
            i = r->u.cmu_mux.node;
            if ((mult >> r->u.cmu_mux.parent) & 1)
              mult |= EFM32_CLK_MASK(i);
            break;
          case DEV_RES_CMU_OSC:
            i = r->u.cmu_osc.node;
            break;
          default:
            continue;
          }
        mult |= once & EFM32_CLK_MASK(i);
        once |= EFM32_CLK_MASK(i);
    });

    if ((mult >> EFM32_CLOCK_HFCLK) & 1)
      mult |= EFM32_CLOCK_HFCORECLK_CHILDMASK | EFM32_CLOCK_HFPERCLK_CHILDMASK;
    if ((mult >> EFM32_CLOCK_LFACLK) & 1)
      mult |= EFM32_CLOCK_LFACLK_CHILDMASK;
    if ((mult >> EFM32_CLOCK_LFBCLK) & 1)
      mult |= EFM32_CLOCK_LFBCLK_CHILDMASK;
  } while (o != mult);
#endif

  /* init oscilator nodes */
  for (i = 0; i < EFM32_CLOCK_EP_COUNT; i++)
    {
      dev_clock_source_init(dev, &pv->src[i], &efm32_recmu_ep_setup);
#ifdef CONFIG_DEVICE_CLOCK_VARFREQ
      if ((mult >> (i + EFM32_CLOCK_FIRST_EP)) & 1)
        pv->src[i].flags |= DEV_CLOCK_EP_VARFREQ;
#endif
    }

  pv->lfclksel = EFM32_CMU_LFCLKSEL_LFA(LFRCO) | EFM32_CMU_LFCLKSEL_LFB(LFRCO);
  pv->hfclk_parent = EFM32_CLOCK_HFRCO;
  pv->lfaclk_parent = EFM32_CLOCK_LFRCO;
  pv->lfbclk_parent = EFM32_CLOCK_LFRCO;
#ifdef EFM32_CLOCK_USBC
  pv->usbcclk_parent = EFM32_CLOCK_HFCLK;
#endif

  efm32_recmu_read_config(pv);

  extern const struct driver_s efm32_recmu_drv;
  if (dev_cmu_init(&efm32_recmu_drv, dev))
    goto err_mem;

  return 0;

 err_mem:
  mem_free(pv);
  return -1;
}

static DEV_CLEANUP(efm32_recmu_cleanup)
{
  struct efm32_recmu_private_s *pv = dev->drv_pv;

  mem_free(pv);

  return 0;
}

DRIVER_DECLARE(efm32_recmu_drv, DRIVER_FLAGS_EARLY_INIT,
               "EFM32 Reset, Energy and Clock management units", efm32_recmu,
               DRIVER_CMU_METHODS(efm32_recmu));

DRIVER_REGISTER(efm32_recmu_drv);

